protocol Test() #up {
    foo(var(#up) #a|#b, x = var(#up) 0..10, y = var(#up) bits(8))
}

@test(#up, ())
with Seq(0..10, _) def main() = seq {
    new Test() {} | seq {
//# missing named field `y`
        foo(#a, x = 1)
//                   ^ expected additional named field

//# missing named field `x`
        foo(#a, y = '00000000)
//                           ^ expected additional named field

//# unexpected named field `z` passed
        foo(#a, x = 1, y = '00000000, z = #foo)
//                                    ^^^^^^^^ unexpected field

//# too many positional fields
        foo(#a, #b, x = 1, y = '00000000)
//              ^^ 1 unexpected positional fields

//# too few positional fields
        foo(x = 1, y = '00000000)
//                              ^ expected 1 more positional fields
    }
}
